// TODO Сделать так, чтобы не было перестроения каждой карточки
// TODO Сделать так, чтобы по нажатии на каждую третью карточку она открывалась и счет был снова 1, сейчас она открывается, потом закрывается вместе со всеми и счет 0. Это ок, но не очень удобно
// TODO Сделать ветку Info с компонентами внутри (Rules, Timer, Highscores)
// TODO Timer отсчитывает время до тех пор, пока игра не закончится
// TODO Сделать БД, куда будут записываться лучшие результаты с выбраным именем
// TODO Highscores отображает в себе 3 лучших результата и кнопку Show more...
// TODO Show more заменяет Инфо на список 10 лучших результатов
// TODO Сделать вариант отображения для мобального: 4 карты в ширину, 8 в высоту, элементы один над другим или по кнопке
// TODO Сделать выбор стиля
// TODO Сделать выбор сложности
// TODO Кнопку резет, которая сбрасывает текуззую игру
// TODO Регулярное выражение или св-во для написания строчек правил с большой буквы и ограничение строки в длину
// TODO Анимация переворота карточки