// TODO Сделать так, чтобы не было перестроения каждой карточки
// TODO Сделать так, чтобы по нажатии на каждую третью карточку она открывалась и счет был снова 1, сейчас она открывается, потом закрывается вместе со всеми и счет 0. Это ок, но не очень удобно
// TODO Сделать функцию для дисейбла совпавших карт

// TODO Этот код еще пригодится, чтобы сбрасывать счетчик и закрывать карты, прт нажатии на фон с двумя открытыми картами, когда фон будет частью компонента.
    // bgCount = () => {
    //     if(this.state.count === 2){
    //         this.setState({
    //             count: 0
    //         })
    //     } else{
    //         return
    //     }
    // }